tmux/tmux.org
#+TITLE: tmux configuration
#+PROPERTY: header-args+ :results output silent :noweb tangle :comments both :mkdirp yes
#+TODO: FIXME | FIXED

* Resources
- https://thevaluable.dev/tmux-boost-productivity-terminal/

* tmux++
:PROPERTIES:
:header-args+: :tangle tmuxw.bash
:END:

Wrapper around tmux to add more functionality. This file must be sourced
#+begin_src bash
#!/usr/bin/env bash
#+end_src

Wrapper around the tmux command
#+begin_src bash
tmux::exe() {
    LANG=en_US.UTF-8 TMUX_DEFAULT_OPTS="$TMUX_DEFAULT_OPTS ${TMUX_DEFAULT_SOCKET:+-L $TMUX_DEFAULT_SOCKET}" command tmux "$@"
}
#+end_src

Attach to existing session or else create a new one
#+begin_src bash
tmux::attach_or_new() {
    if [[ ! -z "$TMUX" ]]; then return; fi

    if [[ -z "$1" ]]; then
        tmux::exe -2 attach-session || tmux::exe -2 new-session
    else
        # This doesn't work when the supplied argument is a subset of an already existing session name
        # For eg. if we have a session called DebugBus, and we check if the session "Debug" exists, tmux returns true
        # tmux -2 attach-session -t "$@" || ( echo "Creating new session..." && tmux -2 new-session -s "$@" )

        if [[ $(tm ls | grep -P "^$1\b" 2> /dev/null) ]]; then
            #echo "Attaching to exising session..."
            tmux::exe -2 attach-session -t "$@"
        else
            echo "Creating new session $1 ..."
            tmux::exe -2 new-session -s "$1"
        fi
    fi
}
#+end_src


Update environment variables in TMUX. From https://raim.codingfarm.de/blog/2013/01/30/tmux-update-environment/
#+begin_src bash
tmux::update_env() {
    echo "Updating to latest tmux environment...";

    local _line;
    while read _line; do
        if [[ $_line == -* ]]; then
            unset ${_line/#-/}
        else
            _line=${_line/=/=\"}
            _line=${_line/%/\"}
            eval export $_line;
        fi;
    done < <(tmux show-environment)

    echo "...done"
}
#+end_src

Helper functions to simplify sending keys
#+begin_src bash
tmux::send_keys_other_panes() {
    local _pane_current=$(tmux display-message -p '#P')
    for _pane in $(tmux list-panes -F '#P'); do
        if (( "$_pane" != "$_pane_current" )); then
            tmux::exe send-keys -t ${_pane} "$@"
        fi
    done
}

tmux::send_keys_all_panes() {
    for _pane in $(tmux list-panes -F '#P'); do
        tmux::exe send-keys -t ${_pane} "$@"
    done
}

tmux::send_keys_all() {
    for _window in $(tmux list-windows -F '#I'); do
        for _pane in $(tmux list-panes -t ${_window} -F '#P'); do
            tmux::exe send-keys -t ${_window}.${_pane} "$@"
        done
    done
}
#+end_src

Custom layout for work
#+begin_src bash
tmux::_select_layout_work() {
    local num_panes=$(tmux::exe display-message -p "#{window_panes}")
    local win_width=$(tmux::exe display-message -p "#{window_width}")
    local win_width_by2=$(( $win_width / 2 ))
    local win_width_by4=$(( $win_width / 4 ))
    local win_height=$(tmux::exe display-message -p "#{window_height}")
    local win_height_by2=$(( $win_height / 2 ))

    local curr_pane=$(tmux::exe display-message -p "#{pane_index}")
    local curr_path=$(tmux::exe display-message -p "#{pane_current_path}")
    for (( i = $num_panes; i < 3; i++ )); do
        tmux::exe split-window -h -c "$curr_path"
    done

    if [[ "$1" == "work-max" ]]; then
        tmux::exe select-layout "1be5,639x73,0,0{319x73,0,0,0,159x73,320,0,1,159x73,480,0,58}"
        tmuxw resize-pane -t 2 -x 100% > /dev/null
        tmuxw resize-pane -t 1 -x 50% > /dev/null
    elif [[ "$1" == "work-home" ]]; then
        tmux::exe select-layout "1be5,639x73,0,0{319x73,0,0,0,159x73,320,0,1,159x73,480,0,58}"
        tmuxw resize-pane -t 1 -x 25% > /dev/null
        tmuxw resize-pane -t 2 -x 50% > /dev/null
    elif [[ "$1" == "work-pc" ]]; then
        tmux::exe select-layout "1be5,639x73,0,0{319x73,0,0,0,159x73,320,0,1,159x73,480,0,58}"
        tmuxw resize-pane -t 1 -x 50% > /dev/null
        tmuxw resize-pane -t 2 -x 25% > /dev/null
    elif [[ "$1" == "work-lp" ]]; then
        tmux::exe select-layout "96ed,319x66,0,0{159x66,0,0,0,159x66,160,0[159x32,160,0,1,159x33,160,33,90]}"
        tmuxw resize-pane -t 1 -x 50% > /dev/null
        tmuxw resize-pane -t 2 -y 50% > /dev/null
    fi

    tmux::exe select-pane -t $curr_pane
}
#+end_src

Helper function to name a pane
#+begin_src bash
tmux::_rename_pane() {
    local _name
    if [[ -n "$1" ]]; then
        _name="$1"
    else
        read -p "Enter Pane Name: " _name;
    fi
    printf "\033]2;%s\033\\r:r" "${_name}";

    if [[ $(tmux display-message -p "#{pane-border-status}") == "off" ]]; then
        tmux setw -g pane-border-status top
    fi
}
#+end_src

Top-level wrapper function
#+begin_src bash
tmuxw() {
    if (( $# == 0 )); then
        tmux::exe
        return
    fi

    local cmd=$1; shift;

    case $cmd in
        attach-new|an)
            # if (( $(tmux::exe -V) < 2.3 )); then
            tmux::attach_or_new "$@"
            # else
            # tmux::exe new-session -A -s "$@"
            # fi
            ;;

        msg)
            tmux::exe display-message "$@"
            ;;

        resize-p*|resizep)
            # From https://github.com/tmux/tmux/issues/888#issuecomment-297637138
            if [[ "$*" =~ -[xy][[:space:]]+[[:digit:]]+% ]]; then
                local perVal=$(sed -e 's/^.*-[xy]\s*//' -e 's/%.*//' <<< "$*")
                if [[ "$*" =~ -x ]]; then
                    local absVal=$(( $(tmux::exe display-message -p "#{window_width}") * $perVal / 100 ))
                elif [[ "$*" =~ -y ]]; then
                    local absVal=$(( $(tmux::exe display-message -p "#{window_height}") * $perVal / 100 ))
                fi
                echo "tmux resize-pane $(sed "s/${perVal}%/${absVal}/" <<< "$*")"
                eval "tmux::exe resize-pane $(sed "s/${perVal}%/${absVal}/" <<< "$*")"
            else
                tmux::exe ${cmd} "$@"
            fi
            ;;

        rename-pane)
            tmux::_rename_pane "$@"
            ;;

        respawn)
            # From https://github.com/tmux/tmux/issues/1036
            pkill -USR1 tmux
            ;;

        restore-session)
            ${XDG_CONFIG_HOME:-$HOME/.config}/tmux/plugins/tmux-resurrect/scripts/restore.sh
            ;;

        save-layout)
            eval $1=$(tmux::exe display-message -p "#{window_layout}")
            echo "Saved current layout to $1"
            ;;

        save-session)
            ${XDG_CONFIG_HOME:-$HOME/.config}/tmux/plugins/tmux-resurrect/scripts/save.sh
            ;;

        select-layout|sl)
            if [[ "$1" =~ "work" ]]; then
                tmux::_select_layout_work "$1"
            else
                tmux::exe "${cmd}" "$@"
            fi
            ;;

        send-keys-all|ska)
            tmux::send_keys_all "$@"
            ;;

        send-keys-all-panes|skap)
            tmux::send_keys_all_panes "$@"
            ;;

        send-keys-other-panes|skop)
            tmux::send_keys_other_panes "$@"
            ;;

        sk)
            tmux::exe send-keys "$@"
            ;;

        update-env|ue)
            if (( $# > 0 )); then echo "Ignoring extra arguments: '$@'"; fi
            tmux::update_env
            ;;

        update-env-all|uea)
            tmuxw send-keys-all "tmuxw ue" C-m
            ;;

        update-env-all-panes|ueap)
            tmuxw send-keys-all-panes "tmuxw ue" C-m
            ;;

        ,*)
            tmux::exe ${cmd} "$@"
    esac
}
#+end_src

