tmux/tmux.org
* tmux.conf
:PROPERTIES:
:header-args+: :tangle tmux.conf
:ID:       6753e99d-778e-452e-bb61-017101cf3c6e
:END:
#+begin_src conf :export none
  # This is a tangled file. Do not make any changes here. All changes should preferably be made in the original Org file.
  # Use =org-babel-tangle-jump-back-to-org= to jump back to it from any code block.
  # If any changes are made here, use =org-babel-detangle= to add it back to the original Org mode file.
#+end_src

[[https://linux.die.net/man/1/tmux][tmux man page]]
To show options:
- =tmux show-options -g [option_name]= Show global option/show all if none specified
- =tmux show-options -w [option_name]= Show window option/show all if none specified
- =tmux show-options -s [option_name]= Show server option/show all if none specified

** Main options
=C-b= is a pain to use when in copy mode as to scroll-up a full screen, we've to press =C-b= twice since upon the first press it's interpreted as a prefix.
Thus change it to =C-Space=. =C-a= is the default prefix used by screen but it collides with emacs readline
#+begin_src conf
  unbind C-b
  unbind C-Space
  unbind -T copy-mode 'C-Space'
  set -g prefix C-Space
  # For nested Tmux sessions
  # bind C-Space send-prefix
#+end_src

Disable wait for escape sequence to enable faster command sequence
#+begin_src conf
  set -sg escape-time 0
  set -sg repeat-time 600
#+end_src

Disable mouse support. I'd rather use mouse to scroll in vim
#+begin_src conf
  set -g mouse off
#+end_src

Set bash as the default shell
#+begin_src conf :tangle no
  set -g default-shell /tool/pandora64/bin/bash
#+end_src

vi-mode for copy-paste
#+begin_src conf
  setw -g mode-keys vi
#+end_src

Set the default terminal mode to 256color mode
#+begin_src conf
  set -g default-terminal "xterm-256color"
#+end_src

Sane scrolling (http://superuser.com/a/314620)
24-bit color support (https://www.reddit.com/r/emacs/comments/8ndm2x/gnu_emacs_261_24bit_colors_suckless_st_terminal/dzwh4vv/)
#+begin_src conf
  set -ga terminal-overrides ',xterm*:smcup@:rmcup@,*256col*:Tc'
#+end_src

#+begin_src conf
  set -g history-limit 10000
  setw -g alternate-screen on
#+end_src

To allow =FocusGained= and =FocusLost= autocmds to work in vim (https://github.com/tmux-plugins/vim-tmux-focus-events)
#+begin_src conf
  set -g focus-events on
#+end_src

** Status Bar configuration
#+begin_src conf
  set -g status on
#+end_src

Use emacs keybindings in tmux's command prompt. Emacs is the default but if I don't set this explicitly, it gets set to vi as my $VISUAL and $EDITOR are set to gvim and vim respectively.
#+begin_src conf
  set -g status-keys emacs
#+end_src

Left-justify the window list
#+begin_src conf
  set -g status-justify left
#+end_src

Colors!
#+begin_src conf
  set -g status-style fg=colour7,bg=colour18
  #set -g status-left-style fg=white,bg=colour25
  set -g message-style fg=colour7,bg=colour0,bright
#+end_src

Increase the time between refresh (Default=15)
#+begin_src conf
  set -g status-interval 60
#+end_src

On the left we have the Session information
#+begin_src conf
  set -g status-left-length 50
  set -g status-left ' #[fg=colour1,bold]#S#[fg=colour7] #[fg=colour20]•'
#+end_src

On the right I have information about running jobs, both local and on LSF and the clock
#+begin_src conf
  set -g status-right-length 60
  set -g status-right "#[fg=colour20]•#[fg=colour4] JOBS: #(command jobs -r 2>/dev/null | wc -l)r #(command jobs -s 2> /dev/null | wc -l)s #[fg=colour20]• #[fg=colour3]%b %d, %a %H:%M "
#+end_src

Enable activity alerts
#+begin_src conf
  setw -g monitor-activity on
  set  -g visual-activity on
#+end_src

Attempt to set the window title using the =\e]2;...\007= xterm code if the terminal appears to be an xterm
Since I'm using xterm in full-screen mode, I don't bother with the title anymore
#+begin_src conf :tangle no
  set -g set-titles on
  # set -g set-titles-string '#H #S'
#+end_src

** Pane configuration
Set the starting pane index to 1
#+begin_src conf
  setw -g pane-base-index 1
#+end_src

I'm making the active pane stand-out by changing its background color.
I don't really need a border for the active-pane so I'm setting it to the background color itself so that I get some space around the active pane.
Also, I set the border only for the inactive panes to provide visual separation when multiple inactive panes are adjacent to each other
#+begin_src conf
  set -g pane-active-border-style 'bg=colour18 fg=colour18'
  set -g pane-border-style 'bg=colour18 fg=colour18'
#+end_src

** Window configuration
Set the starting window index to 1
#+begin_src conf
  set -g base-index 1
#+end_src

Make active pane stand out. Colors as set by solarized theme
#+begin_src conf
  setw -g window-active-style 'bg=colour0'  # bg color of active pane
  setw -g window-style        'bg=colour18'  # bg color of inactive panes
#+end_src

Status Bar display
#+begin_src conf
  setw -g window-status-format "#[fg=colour20] #I:#W "
  setw -g window-status-style bright
  setw -g window-status-current-format "#[attr=bright]#[fg=colour5] #I:#W "
  setw -g window-status-current-style bright
#+end_src

Blink the pane tab in case of any activity
#+begin_src conf
  setw -g window-status-activity-style blink
#+end_src

Window is only constrained in size if a smaller client is actively looking at it
#+begin_src conf
  setw -g aggressive-resize on
#+end_src

