tmux/tmux.conf
# tmux.conf
# :PROPERTIES:
# :header-args+: :tangle tmux.conf
# :ID:       6753e99d-778e-452e-bb61-017101cf3c6e
# :END:

# [[file:~/.config/dotfiles/tmux/tmux.org::*tmux.conf][tmux.conf:1]]
# This is a tangled file. Do not make any changes here. All changes should preferably be made in the original Org file.
# Use =org-babel-tangle-jump-back-to-org= to jump back to it from any code block.
# If any changes are made here, use =org-babel-detangle= to add it back to the original Org mode file.
# tmux.conf:1 ends here

# Main options
# =C-b= is a pain to use when in copy mode as to scroll-up a full screen, we've to press =C-b= twice since upon the first press it's interpreted as a prefix.
# Thus change it to =C-Space=. =C-a= is the default prefix used by screen but it collides with emacs readline

# [[file:~/.config/dotfiles/tmux/tmux.org::*Main%20options][Main options:1]]
unbind C-b
unbind C-Space
unbind -T copy-mode 'C-Space'
set -g prefix C-Space
# For nested Tmux sessions
# bind C-Space send-prefix
# Main options:1 ends here



# Disable wait for escape sequence to enable faster command sequence

# [[file:~/.config/dotfiles/tmux/tmux.org::*Main%20options][Main options:3]]
set -sg escape-time 0
set -sg repeat-time 600
# Main options:3 ends here



# Disable mouse support. I'd rather use mouse to scroll in vim

# [[file:~/.config/dotfiles/tmux/tmux.org::*Main%20options][Main options:4]]
set -g mouse off
# Main options:4 ends here



# vi-mode for copy-paste

# [[file:~/.config/dotfiles/tmux/tmux.org::*Main%20options][Main options:6]]
setw -g mode-keys vi
# Main options:6 ends here



# Set the default terminal mode to 256color mode

# [[file:~/.config/dotfiles/tmux/tmux.org::*Main%20options][Main options:7]]
set -g default-terminal "xterm-256color"
# Main options:7 ends here



# Sane scrolling (http://superuser.com/a/314620)
# 24-bit color support (https://www.reddit.com/r/emacs/comments/8ndm2x/gnu_emacs_261_24bit_colors_suckless_st_terminal/dzwh4vv/)

# [[file:~/.config/dotfiles/tmux/tmux.org::*Main%20options][Main options:8]]
set -ga terminal-overrides ',xterm*:smcup@:rmcup@,*256col*:Tc'
# Main options:8 ends here

# [[file:~/.config/dotfiles/tmux/tmux.org::*Main%20options][Main options:9]]
set -g history-limit 10000
setw -g alternate-screen on
# Main options:9 ends here



# To allow =FocusGained= and =FocusLost= autocmds to work in vim (https://github.com/tmux-plugins/vim-tmux-focus-events)

# [[file:~/.config/dotfiles/tmux/tmux.org::*Main%20options][Main options:10]]
set -g focus-events on
# Main options:10 ends here

# Status Bar configuration

# [[file:~/.config/dotfiles/tmux/tmux.org::*Status%20Bar%20configuration][Status Bar configuration:1]]
set -g status on
# Status Bar configuration:1 ends here



# Use emacs keybindings in tmux's command prompt. Emacs is the default but if I don't set this explicitly, it gets set to vi as my $VISUAL and $EDITOR are set to gvim and vim respectively.

# [[file:~/.config/dotfiles/tmux/tmux.org::*Status%20Bar%20configuration][Status Bar configuration:2]]
set -g status-keys emacs
# Status Bar configuration:2 ends here



# Left-justify the window list

# [[file:~/.config/dotfiles/tmux/tmux.org::*Status%20Bar%20configuration][Status Bar configuration:3]]
set -g status-justify left
# Status Bar configuration:3 ends here



# Colors!

# [[file:~/.config/dotfiles/tmux/tmux.org::*Status%20Bar%20configuration][Status Bar configuration:4]]
set -g status-style fg=colour7,bg=colour18
#set -g status-left-style fg=white,bg=colour25
set -g message-style fg=colour7,bg=colour0,bright
# Status Bar configuration:4 ends here



# Increase the time between refresh (Default=15)

# [[file:~/.config/dotfiles/tmux/tmux.org::*Status%20Bar%20configuration][Status Bar configuration:5]]
set -g status-interval 60
# Status Bar configuration:5 ends here



# On the left we have the Session information

# [[file:~/.config/dotfiles/tmux/tmux.org::*Status%20Bar%20configuration][Status Bar configuration:6]]
set -g status-left-length 50
set -g status-left ' #[fg=colour1,bold]#S#[fg=colour7] #[fg=colour20]•'
# Status Bar configuration:6 ends here



# On the right I have information about running jobs, both local and on LSF and the clock

# [[file:~/.config/dotfiles/tmux/tmux.org::*Status%20Bar%20configuration][Status Bar configuration:7]]
set -g status-right-length 60
set -g status-right "#[fg=colour20]•#[fg=colour4] JOBS: #(command jobs -r 2>/dev/null | wc -l)r #(command jobs -s 2> /dev/null | wc -l)s #[fg=colour20]• #[fg=colour3]%b %d, %a %H:%M "
# Status Bar configuration:7 ends here



# Enable activity alerts

# [[file:~/.config/dotfiles/tmux/tmux.org::*Status%20Bar%20configuration][Status Bar configuration:8]]
setw -g monitor-activity on
set  -g visual-activity on
# Status Bar configuration:8 ends here

# Pane configuration
# Set the starting pane index to 1

# [[file:~/.config/dotfiles/tmux/tmux.org::*Pane%20configuration][Pane configuration:1]]
setw -g pane-base-index 1
# Pane configuration:1 ends here



# I'm making the active pane stand-out by changing its background color.
# I don't really need a border for the active-pane so I'm setting it to the background color itself so that I get some space around the active pane.
# Also, I set the border only for the inactive panes to provide visual separation when multiple inactive panes are adjacent to each other

# [[file:~/.config/dotfiles/tmux/tmux.org::*Pane%20configuration][Pane configuration:2]]
set -g pane-active-border-style bg=colour18
set -g pane-border-style bg=colour18
# Pane configuration:2 ends here

# Window configuration
# Set the starting window index to 1

# [[file:~/.config/dotfiles/tmux/tmux.org::*Window%20configuration][Window configuration:1]]
set -g base-index 1
# Window configuration:1 ends here



# Make active pane stand out. Colors as set by solarized theme

# [[file:~/.config/dotfiles/tmux/tmux.org::*Window%20configuration][Window configuration:2]]
setw -g window-active-style 'bg=colour0'  # bg color of active pane
setw -g window-style        'bg=colour18'  # bg color of inactive panes
# Window configuration:2 ends here



# Status Bar display

# [[file:~/.config/dotfiles/tmux/tmux.org::*Window%20configuration][Window configuration:3]]
setw -g window-status-format "#[fg=colour20] #I:#W "
setw -g window-status-style bright
setw -g window-status-current-format "#[attr=bright]#[fg=colour5] #I:#W "
setw -g window-status-current-style bright
# Window configuration:3 ends here



# Blink the pane tab in case of any activity

# [[file:~/.config/dotfiles/tmux/tmux.org::*Window%20configuration][Window configuration:4]]
setw -g window-status-activity-style blink
# Window configuration:4 ends here



# Window is only constrained in size if a smaller client is actively looking at it

# [[file:~/.config/dotfiles/tmux/tmux.org::*Window%20configuration][Window configuration:5]]
setw -g aggressive-resize on
# Window configuration:5 ends here
