tmux/tmux.org
** Bindings
Mostly, there's a method to the keybinding madness
- I use as many as vim's bindings as possible. Since I use evil in emacs I only end up having to learn one set of bindings that I can use everywhere
- Pane and Window bindings use similar suffix for related behavior eg. =h= to go to the 'left' one. I differentiate between them depending on the prefix. eg. Ctrl is used for panes while Ctrl+Shift is used for window bindings where applicable

=-r= indicates that the binding is repeatable i.e. the prefix need not be pressed again to use it

Reload tmux.conf
#+begin_src conf
  unbind r
  bind r   source-file ~/.config/tmux/tmux.conf \; refresh-client -S\; display-message " Config reloaded".
  unbind C-r
  bind C-r source-file ~/.config/tmux/tmux.conf \; refresh-client -S\; display-message " Config reloaded".
#+end_src

Remove suspend-client binding
#+begin_src conf
  unbind C-z
#+end_src

Allows fast scrolling through a pane's history. -e specifies that scrolling to the bottom exits copy-mode
#+begin_src conf
  bind PageUp copy-mode -eu
#+end_src

Copy-Paste
Use =prefix+]= to paste. =prefix+p= would be the logical choice for paste but it's better used in next/previous context
#+begin_src conf
  bind -T copy-mode-vi 'v'   send -X begin-selection
  bind -T copy-mode-vi 'V'   send -X select-line
  bind -T copy-mode-vi 'C-v' send -X rectangle-toggle
  bind -T copy-mode-vi 'y'   send -X copy-selection-and-cancel
  bind -T copy-mode-vi 'Y'   send -X copy-pipe-and-cancel
#+end_src

Use fzf to select and switch sessions. =prefix+s= is tmux's way of doing it (using =choose-tree=)
#+begin_src conf
  bind F switch-client -Tfzf-table
  bind -Tfzf-table s split-window -l 12 'bash -ci fzf-tmux-select-session > /dev/null'
#+end_src

*** FIXME COMMENT Mouse bindings
Make mouse more useful (from [[https://old.reddit.com/r/tmux/comments/cpvd02/can_i_pass_only_mousescroll_to_shell/ewtd5a3/][reddit]]). There's also [[https://github.com/NHDaly/tmux-better-mouse-mode][tmux-better-mouse-mode]] which I'm yet to try
On a wheelup event:
- if mouse is enabled, send the mouse event,
- else if we're in an alternate screen program, send the up key,
- else if pane is in copy mode, send the mouse event,
- else put the current pane into copy mode and send the mouse event.
(Nested ifs are not fun)

#+begin_src conf
  bind -n WheelUpPane if-shell -Ft= "#{mouse_any_flag}" "send-keys -M" "if-shell -Ft= '#{alternate_on}' 'send-keys -t= up' 'if-shell -Ft= \"#{pane_in_mode}\" \"send-keys -M\" \"select-pane -t=; copy-mode -e; send-keys -M\"'"
#+end_src

On a wheeldown event:
- if we're in an alternate screen program, send the down key,
- else, just send the mouse event

#+begin_src conf
  bind -n WheelDownPane if-shell -Ft= "#{alternate_on}" "send-keys -t= down" "select-pane -t= \; send-keys -M"
#+end_src

*** Pane bindings
I tried to use this as a repeatable binding (by using =-r=) but most of the time it hinders rather than helps.
I never use more than 2 panes vertically and/or horizontally so most of the time I'm just 1 prefix away.
Making this repeatable means that once I'm in my target pane tmux is still in repeatable binding mode so I've to explicitly press Escape to get out of it.
#+begin_src conf
  bind C-w last-pane
#+end_src

Use h-j-k-l instead of arrow keys
#+begin_src conf
  unbind Up
  unbind Down
  unbind Left
  unbind Right

  bind C-h select-pane -L
  bind C-j select-pane -D
  bind C-k select-pane -U
  bind C-l select-pane -R

  bind h select-pane -L
  bind j select-pane -D
  bind k select-pane -U
  bind l select-pane -R
#+end_src

Kill pane without confirmation
#+begin_src conf
  bind c   kill-pane
  bind C-o kill-pane -a
#+end_src

Create Panes. Use vim's bindings to create splits here. It's more intuitive
#+begin_src conf
  bind -r C-s split-window -v -c '#{pane_current_path}'
  bind -r C-v split-window -h -c '#{pane_current_path}'
#+end_src

Goto Pane
bind C-g display-panes
#+begin_src conf
  bind C-g display-panes
#+end_src

Resize Panes
#+begin_src conf
  bind -r M-Up    resize-pane -U 6
  bind -r M-Down  resize-pane -D 6
  bind -r M-Left  resize-pane -L 24
  bind -r M-Right resize-pane -R 24
#+end_src

Swap panes. These are the default bindings
#+begin_src conf :tangle no
  bind -r { swap-pane -U
  bind -r } swap-pane -D
#+end_src

**** FIXME Zoom vertically/horizontally
From https://github.com/tmux/tmux/issues/1868#issuecomment-520240204

#+begin_src conf :tangle no
bind -n M-z if -F '#{@layout_save}' \
    {run 'tmux select-layout "#{@layout_save}" \; set -up @layout_save'} \
    {set -Fp @layout_save "#{window_layout}" ; run 'tmux resizep -y "#{window_height}"'}
#+end_src

Instead of creating a bind, maybe expand tmux's =<prefix> >= menu

*** Window bindings

#+begin_src conf
  bind -r C-w last-window
#+end_src

#+begin_src conf
  bind -r H     previous-window
  bind -r C-S-h previous-window
  bind -r L     next-window
  bind -r C-S-l next-window
#+end_src

#+begin_src conf
  bind M-7 run-shell 'bash -ci "tmuxw select-layout work-lp"  > /dev/null'
  bind M-8 run-shell 'bash -ci "tmuxw select-layout work-pc"  > /dev/null'
  bind M-9 run-shell 'bash -ci "tmuxw select-layout work-max" > /dev/null'
#+end_src

#+begin_src conf
  bind -r N     new-window
  bind -r C-S-n new-window
#+end_src

Kill window without confirmation, kill other windows
#+begin_src conf
  bind C   kill-window
  bind C-o kill-window -a
#+end_src

#+begin_src conf :tangle no
  bind C-j command-prompt -p "Join pane to:"  "join-pane -t ':%%'"
#+end_src

** Tmux Plugins
#+begin_src conf
set -g @plugin 'tmux-plugins/tpm'
set -g @plugin 'tmux-plugins/tmux-resurrect'
set -g @plugin 'tmux-plugins/tmux-continuum'
#+end_src

Initialize TMUX plugin manager (keep this line at the very bottom of tmux.conf)
#+begin_src conf
run '~/.config/tmux/plugins/tpm/tpm'
#+end_src

tmux-resurrect clobbers =C-s= and =C-r= bindings so I need to clobber its bindings!
Remmove after https://github.com/tmux-plugins/tmux-resurrect/issues/370 is resolved
#+begin_src conf
unbind C-r
bind C-r source-file ~/.config/tmux/tmux.conf \; refresh-client -S\; display-message " Config reloaded".

unbind C-s
bind -r C-s split-window -v -c '#{pane_current_path}'
#+end_src

* Local variables                                                                         :noexport:
:PROPERTIES:
:header-args: :tangle no :export none
:END:
Use =add-file-local-variable= or =add-file-local-variable-prop-line= instead of adding these manually

# [[https://www.reddit.com/r/emacs/comments/372nxd/how_to_move_init_to_orgbabel/crjicdv/][Auto-tangle on save]]

# Local Variables:
# eval: (add-hook 'after-save-hook (lambda ()(org-babel-tangle)) nil t)
# org-enforce-todo-checkbox-dependencies: nil
# org-enforce-todo-dependencies: nil
# org-refile-targets: ((nil :maxlevel . 9))
# End:
