tmux/tmux.conf

# Bindings
# Mostly, there's a method to the keybinding madness
# - I use as many as vim's bindings as possible. Since I use evil in emacs I only end up having to learn one set of bindings that I can use everywhere
# - Pane and Window bindings use similar suffix for related behavior eg. =h= to go to the 'left' one. I differentiate between them depending on the prefix. eg. Ctrl is used for panes while Ctrl+Shift is used for window bindings where applicable

# =-r= indicates that the binding is repeatable i.e. the prefix need not be pressed again to use it

# Reload tmux.conf

# [[file:~/.config/dotfiles/tmux/tmux.org::*Bindings][Bindings:1]]
unbind r
bind r   source-file ~/.config/tmux/tmux.conf \; refresh-client -S\; display-message " Config reloaded".
unbind C-r
bind C-r source-file ~/.config/tmux/tmux.conf \; refresh-client -S\; display-message " Config reloaded".
# Bindings:1 ends here



# Remove suspend-client binding

# [[file:~/.config/dotfiles/tmux/tmux.org::*Bindings][Bindings:2]]
unbind C-z
# Bindings:2 ends here



# Allows fast scrolling through a pane's history. -e specifies that scrolling to the bottom exits copy-mode

# [[file:~/.config/dotfiles/tmux/tmux.org::*Bindings][Bindings:3]]
bind PageUp copy-mode -eu
# Bindings:3 ends here



# copy-paste.
# Use =prefix+]= to paste. =prefix+p= would be the logical choice for paste but it's better used in next/previous context

# [[file:~/.config/dotfiles/tmux/tmux.org::*Bindings][Bindings:4]]
bind -T copy-mode-vi 'v'   send -X begin-selection
bind -T copy-mode-vi 'V'   send -X select-line
bind -T copy-mode-vi 'C-v' send -X rectangle-toggle
bind -T copy-mode-vi 'y'   send -X copy-selection-and-cancel
bind -T copy-mode-vi 'Y'   send -X copy-pipe-and-cancel
# Bindings:4 ends here



# Use fzf to select and switch sessions. =prefix+s= is tmux's way of doing it (using =choose-tree=)

# [[file:~/.config/dotfiles/tmux/tmux.org::*Bindings][Bindings:5]]
bind F switch-client -Tfzf-table
bind -Tfzf-table s split-window -l 12 'bash -ci fzf-tmux-select-session > /dev/null'
# Bindings:5 ends here

# Pane bindings
# I tried to use this as a repeatable binding (by using =-r=) but most of the time it hinders rather than helps.
# I never use more than 2 panes vertically and/or horizontally so most of the time I'm just 1 prefix away.
# Making this repeatable means that once I'm in my target pane tmux is still in repeatable binding mode so I've to explicitly press Escape to get out of it.

# [[file:~/.config/dotfiles/tmux/tmux.org::*Pane%20bindings][Pane bindings:1]]
bind C-w last-pane
# Pane bindings:1 ends here



# Use h-j-k-l instead of arrow keys

# [[file:~/.config/dotfiles/tmux/tmux.org::*Pane%20bindings][Pane bindings:2]]
unbind Up
unbind Down
unbind Left
unbind Right

bind C-h select-pane -L
bind C-j select-pane -D
bind C-k select-pane -U
bind C-l select-pane -R

bind h select-pane -L
bind j select-pane -D
bind k select-pane -U
bind l select-pane -R
# Pane bindings:2 ends here



# Kill pane without confirmation

# [[file:~/.config/dotfiles/tmux/tmux.org::*Pane%20bindings][Pane bindings:3]]
bind c   kill-pane
bind C-o kill-pane -a
# Pane bindings:3 ends here



# Create Panes. Use vim's bindings to create splits here. It's more intuitive

# [[file:~/.config/dotfiles/tmux/tmux.org::*Pane%20bindings][Pane bindings:4]]
bind -r C-s split-window -v -c '#{pane_current_path}'
bind -r C-v split-window -h -c '#{pane_current_path}'
# Pane bindings:4 ends here



# Goto Pane
# bind C-g display-panes

# [[file:~/.config/dotfiles/tmux/tmux.org::*Pane%20bindings][Pane bindings:5]]
bind C-g display-panes
# Pane bindings:5 ends here



# Resize Panes

# [[file:~/.config/dotfiles/tmux/tmux.org::*Pane%20bindings][Pane bindings:6]]
bind -r M-Up    resize-pane -U 6
bind -r M-Down  resize-pane -D 6
bind -r M-Left  resize-pane -L 24
bind -r M-Right resize-pane -R 24
# Pane bindings:6 ends here

# Window bindings


# [[file:~/.config/dotfiles/tmux/tmux.org::*Window%20bindings][Window bindings:1]]
bind -r C-w last-window
# Window bindings:1 ends here

# [[file:~/.config/dotfiles/tmux/tmux.org::*Window%20bindings][Window bindings:2]]
bind -r H     previous-window
bind -r C-S-h previous-window
bind -r L     next-window
bind -r C-S-l next-window
# Window bindings:2 ends here

# [[file:~/.config/dotfiles/tmux/tmux.org::*Window%20bindings][Window bindings:3]]
bind M-7 run-shell 'bash -ci "tmuxw select-layout work-lp"  > /dev/null'
bind M-8 run-shell 'bash -ci "tmuxw select-layout work-pc"  > /dev/null'
bind M-9 run-shell 'bash -ci "tmuxw select-layout work-max" > /dev/null'
# Window bindings:3 ends here

# [[file:~/.config/dotfiles/tmux/tmux.org::*Window%20bindings][Window bindings:4]]
bind -r N     new-window
bind -r C-S-n new-window
# Window bindings:4 ends here



# Kill window without confirmation, kill other windows

# [[file:~/.config/dotfiles/tmux/tmux.org::*Window%20bindings][Window bindings:5]]
bind C   kill-window
bind C-o kill-window -a
# Window bindings:5 ends here

# Tmux Plugins

# [[file:~/.config/dotfiles/tmux/tmux.org::*Tmux%20Plugins][Tmux Plugins:1]]
set -g @plugin 'tmux-plugins/tpm'
set -g @plugin 'tmux-plugins/tmux-resurrect'
set -g @plugin 'tmux-plugins/tmux-continuum'
# Tmux Plugins:1 ends here



# Initialize TMUX plugin manager (keep this line at the very bottom of tmux.conf)

# [[file:~/.config/dotfiles/tmux/tmux.org::*Tmux%20Plugins][Tmux Plugins:2]]
run '~/.config/tmux/plugins/tpm/tpm'
# Tmux Plugins:2 ends here



# tmux-resurrect clobbers =C-s= and =C-r= bindings so I need to clobber its bindings!
# Remmove after https://github.com/tmux-plugins/tmux-resurrect/issues/370 is resolved

# [[file:~/.config/dotfiles/tmux/tmux.org::*Tmux%20Plugins][Tmux Plugins:3]]
unbind C-r
bind C-r source-file ~/.config/tmux/tmux.conf \; refresh-client -S\; display-message " Config reloaded".

unbind C-s
bind -r C-s split-window -v -c '#{pane_current_path}'
# Tmux Plugins:3 ends here
